# IsLBItemSelected

## Description
Determines if the specified item is currently selected.

```pascal
FUNCTION IsLBItemSelected(
				dialogID    : LONGINT;
				componentID : LONGINT;
				itemIndex   : INTEGER): BOOLEAN;
```

```python
def vs.IsLBItemSelected(dialogID, componentID, itemIndex):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|
|itemIndex|INTEGER|the row number|

## Version
Availability: from VectorWorks11.0

## Category
* Dialogs - Modern - Browser